#Если ТонкийКлиент Или ВебКлиент Или ТолстыйКлиентУправляемоеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Копирует текст средствами платформы в буфер обмена клиентского компьютера.
// Параметры:
//  Текст - Строка - текст для копирования.
// Возвращаемое значение:
//  Обещание - результат копирования (Булево); Ложь, если буфер недоступен.
Асинх Функция СкопироватьТекстВБуферОбмена(Знач Текст) Экспорт

	Если Не СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		Возврат Ложь;
	КонецЕсли;
	ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
	Если Не СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
		Возврат Ложь;
	КонецЕсли;
	Данные = Новый ЭлементБуфераОбмена(ФорматДанных, Текст);
	Возврат Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(Данные);

КонецФункции

#КонецОбласти

#КонецЕсли
