#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МоделиЗаполнены = Справочники.КИИ_МоделиИИ.МоделиЗаполнены();
	Элементы.ФормаЗаполнитьМодели.Видимость = Не МоделиЗаполнены;
	Если Не МоделиЗаполнены Тогда
		СтрокаСообщения = НСтр("ru = 'Для заполнения предустановленными моделями нажмите ""Заполнить Модели""'",
								ОбщегоНазначения.КодОсновногоЯзыка());
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаполнитьМодели(Команда)
	ЗаполнитьМоделиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМоделиНаСервере()
	
	Справочники.КИИ_МоделиИИ.ЗаполнитьПредустановленныеМодели();
	Элементы.Список.Обновить();
	Элементы.ФормаЗаполнитьМодели.Видимость = Ложь;
	СтрокаСообщения = НСтр("ru = 'Модели успешно заполнены'");
	ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);

КонецПроцедуры

#КонецОбласти