#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		ДатаОбновления = ТекущаяДатаСеанса();
		Возврат;
	КонецЕсли;
	Сохраненные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"Наименование, Содержимое, ДатаОбновления");
	Если Наименование <> Сохраненные.Наименование Или Содержимое <> Сохраненные.Содержимое Тогда
		ДатаОбновления = ТекущаяДатаСеанса();
	Иначе
		ДатаОбновления = Сохраненные.ДатаОбновления;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
