#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Идентификатор нужен обработчику строки и при скрытой колонке.
	Список.УстановитьОбязательноеИспользование("ХешОшибки", Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КИИ_МониторингОшибокКлиент.ПриОткрытии(ЭтотОбъект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	КИИ_МониторингОшибокКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ГлубокийАнализ(Команда)

	КИИ_МониторингОшибокКлиент.ГлубокийАнализ(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияГлубокогоАнализа(Ответ, ХешОшибки) Экспорт

	КИИ_МониторингОшибокКлиент.ПослеПодтвержденияГлубокогоАнализа(ЭтотОбъект, Ответ, ХешОшибки);

КонецПроцедуры

&НаКлиенте
Процедура ПослеГлубокогоАнализа(Результат, ХешОшибки) Экспорт

	КИИ_МониторингОшибокКлиент.ПослеГлубокогоАнализа(ЭтотОбъект, Результат, ХешОшибки);

КонецПроцедуры

&НаКлиенте
Асинх Процедура КопироватьРазбор(Команда)

	Ждать КИИ_МониторингОшибокКлиент.КопироватьРазбор(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьРазбор(Команда)

	КИИ_МониторингОшибокКлиент.РазвернутьРазбор(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПравило(Команда)

	КИИ_МониторингОшибокКлиент.СоздатьПравило(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
