#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура МойВход(Команда)

	Перем ПараметрыВызова;
	Подключение = Элементы.Список.ТекущаяСтрока;
	Если Подключение <> Неопределено И ТипЗнч(Подключение) <> Тип("СправочникСсылка.КИИ_ПодключенияКБазам") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Выберите подключение, а не строку группировки.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Подключение) Тогда
		ПараметрыВызова = Новый Структура("Ключ", Подключение);
		ОткрытьФорму("Справочник.КИИ_ПодключенияКБазам.Форма.ЛичныйВход", ПараметрыВызова, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
