#Область СлужебныеПроцедурыИФункции

&После("ПриОпределенииНастроекРегламентныхЗаданий")
Процедура КИИ_ПриОпределенииНастроекРегламентныхЗаданий(Настройки)

	Задание = Метаданные.РегламентныеЗадания.КИИ_ОбновитьЭмбеддинги;
	Настройка = Настройки.Найти(Задание, "РегламентноеЗадание");
	Если Настройка = Неопределено Тогда
		Настройка = Настройки.Добавить();
		Настройка.РегламентноеЗадание = Задание;
	КонецЕсли;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ОбращаетсяКВнешнимРесурсам = Истина;

КонецПроцедуры

#КонецОбласти
